qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32F3XX/stm32f30x_rtc.c
    *** Backup Data Registers configuration ***
    ===========================================    
    [..]
         (+) To write to the RTC Backup Data registers, use the RTC_WriteBackupRegister()
             function.  
         (+) To read the RTC Backup Data registers, use the RTC_ReadBackupRegister()
             function.  
                                  
                         ##### RTC and low power modes #####
 =============================================================================== 
    [..] The MCU can be woken up from a low power mode by an RTC alternate 
         function.
    [..] The RTC alternate functions are the RTC alarms (Alarm A and Alarm B), 
         RTC wakeup, RTC tamper event detection and RTC time stamp event detection.
         These RTC alternate functions can wake up the system from the Stop 
         and Standby lowpower modes.
         The system can also wake up from low power modes without depending 
         on an external interrupt (Auto-wakeup mode), by using the RTC alarm 
         or the RTC wakeup events.
    [..] The RTC provides a programmable time base for waking up from the 
         Stop or Standby mode at regular intervals.
         Wakeup from STOP and Standby modes is possible only when the RTC 
         clock source is LSE or LSI.
           
                ##### Selection of RTC_AF alternate functions #####
 ===============================================================================
    [..] The RTC_AF pin (PC13) can be used for the following purposes:
         (+) Wakeup pin 2 (WKUP2) using the PWR_WakeUpPinCmd() function.
         (+) AFO_ALARM output      
         (+) AFO_CALIB output
         (+) AFI_TAMPER
         (+) AFI_TIMESTAMP
                         
 +------------------------------------------------------------------------------------------+
 |     Pin         |RTC ALARM |RTC CALIB |RTC TAMPER |RTC TIMESTAMP |PC13MODE|  PC13VALUE   |
 |  configuration  | OUTPUT   | OUTPUT   |  INPUT    |    INPUT     |  bit   |     bit      |
 |  and function   | ENABLED  | ENABLED  | ENABLED   |   ENABLED    |        |              |
 |-----------------|----------|----------|-----------|--------------|--------|--------------|
 |   Alarm out     |          |          |           |              | Don't  |              |
 |   output OD     |     1    |Don't care|Don't care | Don't care   | care   |      0       |
 |-----------------|----------|----------|-----------|--------------|--------|--------------|
 |   Alarm out     |          |          |           |              | Don't  |              |
 |   output PP     |     1    |Don't care|Don't care | Don't care   | care   |      1       |
 |-----------------|----------|----------|-----------|--------------|--------|--------------|
 | Calibration out |          |          |           |              | Don't  |              |
 |   output PP     |     0    |    1     |Don't care | Don't care   | care   |  Don't care  |
 |-----------------|----------|----------|-----------|--------------|--------|--------------|
 |  TAMPER input   |          |          |           |              | Don't  |              |
 |   floating      |     0    |    0     |     1     |      0       | care   |  Don't care  |
 |-----------------|----------|----------|-----------|--------------|--------|--------------|
 |  TIMESTAMP and  |          |          |           |              | Don't  |              |
 |  TAMPER input   |     0    |    0     |     1     |      1       | care   |  Don't care  |
 |   floating      |          |          |           |              |        |              |
 |-----------------|----------|----------|-----------|--------------|--------|--------------|
 | TIMESTAMP input |          |          |           |              | Don't  |              |
 |    floating     |     0    |    0     |     0     |      1       | care   |  Don't care  |
 |-----------------|----------|----------|-----------|--------------|--------|--------------|
 |   Output PP     |     0    |    0     |     0     |      0       |   1    | PC13 output  |
 |    Forced       |          |          |           |              |        |              |
 |-----------------|----------|----------|-----------|--------------|--------|--------------|
 |  Wakeup Pin or  |     0    |    0     |     0     |      0       |   0    | Don't care   |
 |  Standard GPIO  |          |          |           |              |        |              |
 +------------------------------------------------------------------------------------------+
    
  @endverbatim
                      
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2014 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */ 

/* Includes ------------------------------------------------------------------*/
#include "stm32f30x_rtc.h"
#include "stm32f30x_rcc.h"

/** @addtogroup STM32F30x_StdPeriph_Driver
  * @{
  */

/** @defgroup RTC 
  * @brief RTC driver modules
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

